"""
У нас є список показників студентів групи – це список з отриманими балами з тестування.
Необхідно поділити список на дві частини.
Напишіть функцію split_list, яка приймає список (цілі числа),
знаходить середнє значення бала у списку та ділить його на два списки.

У перший потрапляють значення менше середнього, включаючи середнє значення,
тоді як у другий — строго більше від середнього.
Функція повертає кортеж цих двох списків. Для порожнього списку повертаємо два порожні списки.
"""


# split_list([1, 12, 3, 24, 5]) == ([1, 3, 5], [12, 24])
def split_list(grade):
    lower = []
    greater = []

    if len(grade) > 0:
        average = sum(grade) / len(grade)

        for item in grade:
            if item <= average:
                lower.append(item)

            else:
                greater.append(item)

        return (lower, greater)

    else:
        return [], []


print(split_list([1, 12, 3, 24, 5]))
