"""
Всім відомо, що для доступу до кредитної картки банку потрібний пін-код.
Класично склалося, що це поєднання чотири цифри.
Нам необхідно вирішити наступне програмістське завдання. Є підготовлений перелік пін-кодів.
апишіть функцію is_valid_pin_codes, яка буде приймати як параметр список цих пін-кодів
— рядок з чотирьох цифр і повертати логічне значення — валідний список чи ні.
Переконайтеся, що серед цих пін-кодів у списку не буде дублікатів, всі вони зберігаються у вигляді рядків,
їх довжина дорівнює 4 символам і містять вони тільки цифри.

Якщо список відповідає всім поставленим умовам, функція повертає логічне значення True.
Якщо хоч одну з умов порушено, повертається значення — False.
Передбачити перевірку на порожній список в аргументі функції та повернути при цьому значення False
"""


def is_valid_pin_codes(pin_codes):
    valid_codes = set()

    for item in pin_codes:
        if len(item) == 4 and item.isnumeric():
            valid_codes.add(item)

    if pin_codes and len(valid_codes) == len(pin_codes):
        return True
    else:
        return False


print(is_valid_pin_codes(['1101', '9034', '00112']))
print(is_valid_pin_codes(['1101', '9034', '0011', '1101']))
print(is_valid_pin_codes(['1101', '9034', '0011']))
print(is_valid_pin_codes(['1101', '9034', '001a']))
print(is_valid_pin_codes([]))
